{
  "backend/main.mo": "Empty Motoko actor serving as placeholder backend.",
  "feature_evidence.json": "Metadata describing a feature request to darken the global background overlay in frontend/src/index.css.",
  "frontend-file-summaries.txt": "List of prewritten summaries for multiple frontend files and components.",
  "frontend/index.css": "Tailwind base config and OKLCH CSS variables defining light/dark themes and global bg/text styling.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root component that applies theme and renders all major site sections with header and footer.",
  "frontend/src/components/common/GlassCard.tsx": "Reusable glass-effect card wrapper with optional hover and neon styles.",
  "frontend/src/components/common/NeonButton.tsx": "Custom neon-styled button with variants, sizes, and loading state.",
  "frontend/src/components/contact/useContactForm.ts": "Hook managing contact form state, validation, submission simulation, and success handling.",
  "frontend/src/components/layout/SectionShell.tsx": "Generic section wrapper adding spacing, container layout, and optional glass styling.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer with social links, attribution, and dynamic year display.",
  "frontend/src/components/layout/SiteHeader.tsx": "Sticky header with theme toggle, smooth-scroll nav, and mobile menu handling.",
  "frontend/src/components/portfolio/portfolioData.ts": "Defines the PortfolioItem interface and provides categorized sample portfolio items with thumbnails and embedded video links.",
  "frontend/src/components/portfolio/portfolioMedia.ts": "Declares media types and helpers for detecting video media and converting various video URLs into embed formats.",
  "frontend/src/components/portfolio/PortfolioPreviewDialog.tsx": "Modal displaying a portfolio item's video or image with ESC/backdrop close behavior.",
  "frontend/src/components/sections/AboutSection.tsx": "Renders an About section with an image, description, and a grid of creative tools.",
  "frontend/src/components/sections/ContactSection.tsx": "Implements a contact section containing a form with validation, success state, and social icons.",
  "frontend/src/components/sections/HeroSection.tsx": "Displays the hero banner with main headings, intro text, and buttons to scroll to portfolio or contact sections.",
  "frontend/src/components/sections/PortfolioSection.tsx": "Shows categorized portfolio items with thumbnails and opens a preview dialog when an item is selected.",
  "frontend/src/components/sections/ServicesSection.tsx": "Lists available services with icons and descriptions in a grid layout.",
  "frontend/src/components/sections/TestimonialsSection.tsx": "Displays client testimonials inside card components with quotes and author info.",
  "frontend/src/components/visual/BackgroundDecor.tsx": "Adds floating decorative bubble-like background elements with animation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the current Internet Identity and refreshes dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and loading stored identities.",
  "frontend/src/hooks/useScrollToSection.ts": "Exposes a smooth-scrolling helper that scrolls to a DOM section with a fixed header offset.",
  "frontend/src/hooks/useTheme.ts": "Manages light/dark theme state, syncing it with localStorage and applying the theme class to the document root.",
  "frontend/src/index.css": "Defines global Tailwind base styles, CSS variables for light/dark themes, and background/utility styles including neon and glass effects.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClient and InternetIdentity providers and loading global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, fonts, and utilities using CSS variables for theme-driven styling.",
  "project_state.json": "Describes the project’s state, features, and pending requests, including a task to darken the site-wide background."
}