{
  "backend/main.mo": "Empty Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence metadata describing removal of an old portfolio video embed and listing affected files/components.",
  "frontend-file-summaries.txt": "Pre-generated summaries of all frontend source files for reference or build tooling.",
  "frontend/index.css": "Tailwind base/theme variables defining OKLCH color tokens for light/dark modes and core global styles.",
  "frontend/index.html": "HTML entry file containing root div and script loader for the React app.",
  "frontend/src/App.tsx": "Main app component assembling all site sections and applying the stored theme setting.",
  "frontend/src/components/common/GlassCard.tsx": "Reusable glass-style card wrapper with optional hover and neon effects.",
  "frontend/src/components/common/NeonButton.tsx": "Custom neon-styled button component supporting variants, sizes, and loading state.",
  "frontend/src/components/contact/useContactForm.ts": "Hook managing contact form data, validation, submission simulation, and success state.",
  "frontend/src/components/layout/SectionShell.tsx": "Section wrapper that standardizes spacing and optionally applies glass-surface styling.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer with social links, copyright text, and caffeine.ai attribution.",
  "frontend/src/components/layout/SiteHeader.tsx": "Sticky header with theme toggle, navigation, and responsive mobile menu behavior.",
  "frontend/src/components/portfolio/portfolioData.ts": "Defines the PortfolioItem type and a dataset of categorized portfolio items, including thumbnails, descriptions, and optional embedded video media.",
  "frontend/src/components/portfolio/portfolioMedia.ts": "Provides media type definitions plus helpers to detect video media and convert various platform URLs into normalized embed URLs.",
  "frontend/src/components/portfolio/PortfolioPreviewDialog.tsx": "Modal preview dialog rendering video or image content with close controls and backdrop handling.",
  "frontend/src/components/sections/AboutSection.tsx": "Renders the About section with a profile image, description, and a list of editing/design tools.",
  "frontend/src/components/sections/ContactSection.tsx": "Implements a contact section containing a form with validation states and a success message.",
  "frontend/src/components/sections/HeroSection.tsx": "Displays the hero banner with intro text and buttons that scroll to portfolio or contact sections.",
  "frontend/src/components/sections/PortfolioSection.tsx": "Shows categorized portfolio grids and opens a preview dialog when an item is selected.",
  "frontend/src/components/sections/ServicesSection.tsx": "Lists available services with icons and descriptions inside styled cards.",
  "frontend/src/components/sections/TestimonialsSection.tsx": "Displays client testimonials in a three-column layout with quote cards.",
  "frontend/src/components/visual/BackgroundDecor.tsx": "Renders decorative background gradients and animated floating bubble elements.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current Internet Identity, recreating it when identity changes and invalidating related queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and persisted identity loading.",
  "frontend/src/hooks/useScrollToSection.ts": "Offers a helper to smoothly scroll to a page section with a fixed header offset.",
  "frontend/src/hooks/useTheme.ts": "Handles light/dark theme state with localStorage persistence and toggling.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light/dark themes, neon accents, and glass UI utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and Internet Identity providers and loads global CSS.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions including color variables, animations, typography, and container settings.",
  "project_state.json": "Stores metadata about project status, design guidelines, features, and known issues for the portfolio website."
}