{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report describing a background-darkening CSS overlay change affecting index.css.",
  "frontend-file-summaries.txt": "Text file mapping frontend file paths to short descriptive summaries.",
  "frontend/index.css": "Tailwind base layer defining OKLCH design tokens and dark-mode variants for global theme styling.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Root React component assembling all site sections with theme application on mount.",
  "frontend/src/components/common/GlassCard.tsx": "Reusable glass-style card wrapper with optional hover and neon hover effects.",
  "frontend/src/components/common/NeonButton.tsx": "Configurable neon-themed button component with variants, sizes, and loading state.",
  "frontend/src/components/contact/useContactForm.ts": "Custom hook managing contact form state, validation, submission simulation, and success handling.",
  "frontend/src/components/layout/SectionShell.tsx": "Section wrapper providing spacing, container layout, and optional glass styling.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer with social links, copyright, and caffeine.ai attribution.",
  "frontend/src/components/layout/SiteHeader.tsx": "Fixed header with navigation, scroll behavior, theme toggle, and mobile menu.",
  "frontend/src/components/portfolio/portfolioData.ts": "Defines the PortfolioItem type and provides grouped sample portfolio entries with thumbnails and embedded video metadata.",
  "frontend/src/components/portfolio/portfolioMedia.ts": "Provides media type definitions and helpers, including video source handling and URL normalization for embed formats.",
  "frontend/src/components/portfolio/PortfolioPreviewDialog.tsx": "Modal dialog displaying video or image previews with close controls, ESC handling, and backdrop behavior.",
  "frontend/src/components/sections/AboutSection.tsx": "Renders the About section with an image, biography text, and a tools grid inside styled layout components.",
  "frontend/src/components/sections/ContactSection.tsx": "Implements the contact form UI with validation, submission states, and a success message using custom hooks and styled components.",
  "frontend/src/components/sections/HeroSection.tsx": "Displays the hero banner with title, description, CTA buttons, and animated background decorations.",
  "frontend/src/components/sections/PortfolioSection.tsx": "Shows portfolio categories and items with thumbnails, video indicators, and a preview dialog triggered on selection.",
  "frontend/src/components/sections/ServicesSection.tsx": "Lists service offerings with icons and descriptions inside styled glass cards.",
  "frontend/src/components/sections/TestimonialsSection.tsx": "Presents client testimonials in a three-column grid using glass card styling.",
  "frontend/src/components/visual/BackgroundDecor.tsx": "Adds floating decorative bubble elements positioned in the background with animation effects.",
  "frontend/src/hooks/useActor.ts": "Creates an authenticated or anonymous actor via react-query and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useScrollToSection.ts": "Offers a helper to smoothly scroll to a DOM element by ID with a fixed header offset.",
  "frontend/src/hooks/useTheme.ts": "Manages dark/light theme state synced to localStorage and applies the corresponding class to the document root.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables for light/dark modes, global backgrounds, and custom utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with react-query and Internet Identity providers and loads global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugin integrations.",
  "project_state.json": "Stores project metadata, versions, existing features, and pending feature requests."
}