{
  "kind": "build_request",
  "title": "Update Apple bubble background to bright green and black theme",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-2",
      "text": "Update the site-wide background to keep the existing Apple-style bubble aesthetic but switch the palette to bright green and black, including both desktop and mobile/portrait backgrounds.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "make back ground in same apple boubble theme but in bright green abd black colour"
        ]
      },
      "acceptanceCriteria": [
        "Desktop background uses a bright green + black Apple-bubble style image and retains a similar glossy/bubble look to the current design.",
        "Mobile/portrait background uses a matching bright green + black Apple-bubble style image.",
        "No broken image URLs; background renders on initial load without layout shift."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update floating bubble decorative overlays to match the bright green and black Apple-bubble theme so the hero section background decor visually matches the new site-wide background.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "make back ground in same apple boubble theme but in bright green abd black colour"
        ]
      },
      "acceptanceCriteria": [
        "Hero section floating bubble overlays match the updated bright green + black bubble style.",
        "Decor remains subtle (similar opacity levels) and does not reduce text readability in the hero section."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Adjust the global background overlay/gradient (in global CSS) as needed so the bright green + black bubble background remains readable behind content while preserving the Apple-bubble aesthetic.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "make back ground in same apple boubble theme but in bright green abd black colour"
        ]
      },
      "acceptanceCriteria": [
        "Text and key UI elements remain readable over the new background in both light and dark theme modes.",
        "Overlay does not fully wash out the bright green accents; bubbles remain visible.",
        "Background remains fixed/cover behavior as currently implemented."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose existing UI components instead).",
    "Do not edit immutable hook/bootstrap paths listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Backend is single-actor; no backend changes are required for this request."
  ],
  "nonGoals": [
    "Changing typography, layout, or section content beyond what is necessary to maintain readability on the new background.",
    "Adding new authentication, data storage, or backend features."
  ],
  "imageRequirements": {
    "required": [],
    "edits": [
      "Recolor to a bright green and black Apple-bubble theme while retaining a glossy, floating-bubble look (site-background-neon-bubbles.dim_1920x1080.png > site-background-neon-bubbles-green-black.dim_1920x1080.png)",
      "Recolor to a matching bright green and black Apple-bubble theme for mobile/portrait (site-background-neon-bubbles-mobile.dim_1080x1920.png > site-background-neon-bubbles-mobile-green-black.dim_1080x1920.png)",
      "Recolor bubble overlay elements to match bright green and black theme while keeping transparency suitable for overlay usage (bubble-overlays-transparent.dim_1024x1024.png > bubble-overlays-transparent-green-black.dim_1024x1024.png)"
    ]
  }
}